Revit 2027 API
ViewSchedule.GetDefaultNameForNoteBlock Method
 Gets the default view name that will be used when creating a note block.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetDefaultNameForNoteBlock(
	Document document
)
Public Shared Function GetDefaultNameForNoteBlock (
	document As Document
) As String
public:
static String^ GetDefaultNameForNoteBlock(
	Document^ document
)
static member GetDefaultNameForNoteBlock :
        document : Document -> string
Parameters
document Document
 The document to which the new schedule will be added.
Return Value
String
 The default view name.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace